Documents/ПоступлениеСервера_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПоступлениеСервера_ат</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетРесурсовСерверов_ат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Сервера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипСервера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Серверы_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыРесурсов_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыРесурсов_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>RAM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HDD_ат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Частота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Core</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданНаСервере</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическийСервер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPv4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>mask</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>gate</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>dns</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>dns2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AdmPass</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>numproc</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>autostart</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VEID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрешенаАренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентИспользованияПроцессора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентИспользованияПамяти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентИспользованияЖесткогоДиска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборСтатистикиWMI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборСтатистикиVZ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборСтатистикиZabbix</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеСервера_ат/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр УчетРесурсов_ат Приход
	Движения.УчетРесурсов_ат.Записывать = Истина;
	
	
	Для Каждого ТекСтрокаСервера Из Сервера Цикл
		Если ТекСтрокаСервера.ТипСервера.Аренда = Истина тогда
			//Движение = Движения.УчетРесурсов_ат.Добавить();
			//Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			//Движение.Период = Дата;
			//Движение.Сервер = ТекСтрокаСервера.ТипСервера;
			
			// CPU_ат
			Для каждого ТекСтрокаCPU из ТекСтрокаСервера.ТипСервера.CPU_ат Цикл
				Движение = Движения.УчетРесурсов_ат.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Сервер = ТекСтрокаСервера.ТипСервера;
				// Движение.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.Частота;
				//// Вычисляем суммарную частоту всех CPU_ат (частоту * кол-во Ядер * Кол-во Процессоров) 
				//// Переводим из GHz в MHz
				// Движение.ЗначениеРесурса = ТекСтрокаCPU.Процессор.Частота *ТекСтрокаCPU.Процессор.КоличествоЯдер * ТекСтрокаCPU.Количество * 1000;
				Движение.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.Core;
				
				Если ТекСтрокаСервера.ТипСервера.HyperThreading = истина тогда
					Движение.ЗначениеРесурса = ТекСтрокаCPU.Процессор.КоличествоЯдер * ТекСтрокаCPU.Количество * 2;
				Иначе
					Движение.ЗначениеРесурса = ТекСтрокаCPU.Процессор.КоличествоЯдер * ТекСтрокаCPU.Количество;
				КонецЕсли;
				
				
			КонецЦикла;
			// RAM
			Для каждого ТекСтрокаRAM из ТекСтрокаСервера.ТипСервера.RAM Цикл
				Движение = Движения.УчетРесурсов_ат.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Сервер = ТекСтрокаСервера.ТипСервера;
				Движение.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.RAM;
				Движение.ЗначениеРесурса = ТекСтрокаRAM.Количество * ТекСтрокаRAM.МодулиПамяти_ат.РазмерМодуля;
			КонецЦикла;
			// HDD_ат
			Если ТекСтрокаСервера.ТипСервера.Лезвие = Ложь тогда
				Для каждого ТекСтрокаHDD из ТекСтрокаСервера.ТипСервера.HDD_ат Цикл
					Движение = Движения.УчетРесурсов_ат.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Сервер = ТекСтрокаСервера.ТипСервера;
					Движение.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.HDD_ат;
					Движение.ЗначениеРесурса = ТекСтрокаHDD.Объем;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
